'''
Вывести числа которые делятся на 5 и не делятся на 6 в диапазоне от 0 до 200


i = 0
while i <= 200:
    if i % 5 == 0 and not i % 6 == 0:
        print(i)
    i += 1

Вывести таблицу умножения на 6

6*1=6
6*2=12
...
6*10=60

i = 1
while i <= 10:
    print(6, '*', i, '=',6 * i)
    i += 1

1*1=6   2*1=2
1*2=12  2*2=4
... ....
1*10=60 2*10=20

i = 1
while i <= 10: #при i=1 j=1,2,3,4,5,6,7,8,9,10  при i=2 j=1,2,3,4,5,6,7,8,9,10
    j = 1
    while j <= 10:
        print(j, '*', i, '=', i * j, end='\t')
        j += 1
    print()
    i += 1'''

'''
найти сумму чисел от 0 до 100, которые делятся на 3 и на 5
найти произведение чисел от 0 до 100, которые делятся на 6, но не делятся на 7

i=1
s=0
p=1
while i <= 100:
    if i % 3 == 0 and i % 5 == 0:
        s += i
    if i % 6 == 0 and not i % 7 == 0:
        p *= i
    i += 1
print(s, p)'''

